Experience and Education are input or independent fetures and Salary is output or dependent feature.

| Experience (Years) | Education | Salary |
|--------------------|-----------|--------|
| 4                  | BE        | 50k    |
| 6                  | PhD       | 100k   |
| 3                  | Masters   | 80k    |
| 6                  | PhD       | 120k   |

Education is categorical feature. If we give the education as it is then model can't understand the data.

The main aim of data encoding is to convert categorical feature into a numberical feature so that ml model can be trained.

Types of Data Encoding
- Nominal or One Hot Encoding
- Ordinal or Label Encoding
- Target Guided Ordinal Encoding

1) Nominal or OHE (No specific order or rank)

House Price Prediction

## Property Listing

| **No. of Rooms** | **House Size (sq ft)** | **Location**        | **Price (NPR)**  |
|------------------|------------------------|---------------------|------------------|
|                  |                        | Kathmandu           |                  |
|                  |                        | Bhaktapur           |                  |
|                  |                        | Lalitpur            |                  |
|                  |                        | Kathmandu           |                  |
|                  |                        | Bhaktapur           |                  |
|                  |                        | Lalitpur            |                  |

Location (Kathmandu, Bhaktapur, Lalitpur)

Location --> OHE

## Property Listing

| **No. of Rooms** | **House Size (sq ft)** | **Location**        | **Price (NPR)**  | **Kathmandu** | **Bhaktapur** | **Lalitpur** |
|------------------|------------------------|---------------------|------------------|---------------|---------------|--------------|
|                  |                        | Kathmandu           |                  | 1             | 0             | 0            |
|                  |                        | Bhaktapur           |                  | 0             | 1             | 0            |
|                  |                        | Lalitpur            |                  | 0             | 0             | 1            |
|                  |                        | Kathmandu           |                  | 1             | 0             | 0            |
|                  |                        | Bhaktapur           |                  | 0             | 1             | 0            |
|                  |                        | Lalitpur            |                  | 0             | 0             | 1            |

Disadvantage:
- Creates sparse matrix.(10 locations only takes 1 and 0 which leads to overfitting)
- 1000 categories (100 features) . No of features increased , performance of model decreases

In [66]:
# import pandas and one hot encoder
import pandas as pd
from sklearn.preprocessing import OneHotEncoder

In [67]:
# create a dataframe with a single column of color categories
df = pd.DataFrame({
    'color': ['red', 'blue', 'green', 'green', 'blue', 'red']
})

In [68]:
df

   color
0    red
1   blue
2  green
3  green
4   blue
5    red

In [69]:
## Create an instance of the OneHotEncoder
ohe = OneHotEncoder()

In [70]:
ohe.fit_transform(df[['color']])

<Compressed Sparse Row sparse matrix of dtype 'float64'
	with 6 stored elements and shape (6, 3)>

In [71]:
ohe.fit_transform(df[['color']]).toarray()

array([[0., 0., 1.],
       [1., 0., 0.],
       [0., 1., 0.],
       [0., 1., 0.],
       [1., 0., 0.],
       [0., 0., 1.]])

In [72]:
# fit the encoder to the dataframe and transform the categorical variable
encoded = ohe.fit_transform(df[['color']]).toarray()

In [73]:
encoded_df = pd.DataFrame(
    encoded,
    columns=ohe.get_feature_names_out(['color'])
)

In [74]:
encoded_df

   color_blue  color_green  color_red
0         0.0          0.0        1.0
1         1.0          0.0        0.0
2         0.0          1.0        0.0
3         0.0          1.0        0.0
4         1.0          0.0        0.0
5         0.0          0.0        1.0

In [75]:
pd.concat([df, encoded_df], axis=1)

   color  color_blue  color_green  color_red
0    red         0.0          0.0        1.0
1   blue         1.0          0.0        0.0
2  green         0.0          1.0        0.0
3  green         0.0          1.0        0.0
4   blue         1.0          0.0        0.0
5    red         0.0          0.0        1.0

In [76]:
import seaborn as sns
df = sns.load_dataset('tips')

In [77]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [78]:
encoder = OneHotEncoder()

In [79]:
encoder.fit_transform(df[['time']])

<Compressed Sparse Row sparse matrix of dtype 'float64'
	with 244 stored elements and shape (244, 2)>

In [80]:
encoded = encoder.fit_transform(df[['time']]).toarray()

In [81]:
encoded

array([[1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.]])

In [82]:
encoded_df = pd.DataFrame(
    encoded,
    columns=encoder.get_feature_names_out(['time'])
)

In [83]:
encoded_df

     time_Dinner  time_Lunch
0            1.0         0.0
1            1.0         0.0
2            1.0         0.0
3            1.0         0.0
4            1.0         0.0
..           ...         ...
239          1.0         0.0
240          1.0         0.0
241          1.0         0.0
242          1.0         0.0
243          1.0         0.0

[244 rows x 2 columns]

In [84]:
pd.concat([df, encoded_df], axis=1)

     total_bill   tip     sex smoker  ...    time size  time_Dinner  time_Lunch
0         16.99  1.01  Female     No  ...  Dinner    2          1.0         0.0
1         10.34  1.66    Male     No  ...  Dinner    3          1.0         0.0
2         21.01  3.50    Male     No  ...  Dinner    3          1.0         0.0
3         23.68  3.31    Male     No  ...  Dinner    2          1.0         0.0
4         24.59  3.61  Female     No  ...  Dinner    4          1.0         0.0
..          ...   ...     ...    ...  ...     ...  ...          ...         ...
239       29.03  5.92    Male     No  ...  Dinner    3          1.0         0.0
240       27.18  2.00  Female    Yes  ...  Dinner    2          1.0         0.0
241       22.67  2.00    Male    Yes  ...  Dinner    2          1.0         0.0
242       17.82  1.75    Male     No  ...  Dinner    2          1.0         0.0
243       18.78  3.00  Female     No  ...  Dinner    2          1.0         0.0

[244 rows x 9 columns]

Label and Ordinal Encoding

In [85]:
from sklearn.preprocessing import LabelEncoder

In [86]:
df = pd.DataFrame({
    'color': ['red', 'blue', 'green', 'green', 'blue', 'red']
})

In [87]:
df

   color
0    red
1   blue
2  green
3  green
4   blue
5    red

In [88]:
le = LabelEncoder()

In [91]:
le.fit_transform(df['color'])

array([2, 0, 1, 1, 0, 2])

Problem : ML algorithm assumes one is greater than another.

In [92]:
from sklearn.preprocessing import OrdinalEncoder

In [93]:
df = pd.DataFrame({
    'size' : ['small', 'medium', 'large', 'medium', 'small', 'large']
})

In [94]:
# Create an instance of the OrdinalEncoder class and fit transform the dataframe
encoder = OrdinalEncoder(categories=[['small', 'medium', 'large']])

In [95]:
encoder.fit_transform(df[['size']])

array([[0.],
       [1.],
       [2.],
       [1.],
       [0.],
       [2.]])

Target Guided Ordinal Encoding
- It is a technique used to encode categorical variables based on their relationship with target variable.
- We replace each category in the categorical variable with a numerical value based on the mean or median of the target variable of that category.

In [96]:
df = pd.DataFrame({
    'city': ['New York', 'London', 'Paris', 'Tokyo', 'New York', 'Paris'],
    'price': [200, 150, 300, 250, 180, 320]
})

In [99]:
df

       city  price
0  New York    200
1    London    150
2     Paris    300
3     Tokyo    250
4  New York    180
5     Paris    320

In [101]:
df.groupby('city')['price']

In [102]:
# calculate the mean price for each city
df.groupby('city')['price'].mean()

city
London      150.0
New York    190.0
Paris       310.0
Tokyo       250.0
Name: price, dtype: float64

In [103]:
df.groupby('city')['price'].mean().to_dict()

{'London': 150.0, 'New York': 190.0, 'Paris': 310.0, 'Tokyo': 250.0}

In [104]:
mean_price = df.groupby('city')['price'].mean().to_dict()
mean_price

{'London': 150.0, 'New York': 190.0, 'Paris': 310.0, 'Tokyo': 250.0}

In [105]:
df['city_encoded'] = df['city'].map(mean_price)

In [107]:
df

       city  price  city_encoded
0  New York    200         190.0
1    London    150         150.0
2     Paris    300         310.0
3     Tokyo    250         250.0
4  New York    180         190.0
5     Paris    320         310.0